Ran Plan for dir: `accounts/animeutopia-prod` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/ryan-longoria/FeedUtopia/61/default/accounts/animeutopia-prod/animeutopia-prod-default.tfplan" -var-file=tfvars/prod-ue2-animeutopia.tfvars -var-file=/home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars' in '/home/atlantis/.atlantis/repos/ryan-longoria/FeedUtopia/61/default/accounts/animeutopia-prod': exit status 1
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.

aws_iam_role.eventbridge_role: Refreshing state... [id=animeutopia_eventbridge_step_functions_role]
aws_sns_topic.monitoring_topic: Refreshing state... [id=arn:aws:sns:us-east-2:481665084477:animeutopia-monitoring-topic]
data.aws_iam_policy_document.crossaccount_s3_read_role_trust: Reading...
aws_xray_sampling_rule.critical_service_rule: Refreshing state... [id=CriticalService]
aws_sqs_queue.lambda_dlq: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/481665084477/animeutopia-lambda-dlq]
aws_cloudwatch_event_rule.workflow_schedule: Refreshing state... [id=animeutopia_workflow_schedule]
data.aws_iam_policy_document.step_functions_xray: Reading...
aws_iam_role.step_functions_role: Refreshing state... [id=animeutopia_step_functions_role]
data.aws_iam_policy_document.crossaccount_s3_read_policy_doc: Reading...
aws_iam_policy.s3_full_policy: Refreshing state... [id=arn:aws:iam::481665084477:policy/animeutopia_s3_full_policy]
data.aws_iam_policy_document.crossaccount_s3_read_policy_doc: Read complete after 0s [id=2025109738]
data.aws_iam_policy_document.crossaccount_s3_read_role_trust: Read complete after 0s [id=1156554535]
data.aws_iam_policy_document.step_functions_xray: Read complete after 0s [id=1256208417]
aws_cloudwatch_log_group.automated_step_function_log_group: Refreshing state... [id=/aws/vendedlogs/states/automated_workfloww]
aws_xray_group.production_group: Refreshing state... [id=arn:aws:xray:us-east-2:481665084477:group/ProductionTraces/76NN3FFZXAXRXZ63FIGTKHT6XZNBU7PDUVACPL3UJFDXPCWCO3WA]
aws_cloudwatch_log_group.notify_post_log_group: Refreshing state... [id=/aws/lambda/notify_post]
aws_cloudwatch_log_group.fetch_data_log_group: Refreshing state... [id=/aws/lambda/fetch_data]
aws_cloudwatch_log_group.sns_to_teams_log_group: Refreshing state... [id=/aws/lambda/sns_to_teams]
aws_s3_bucket.media_bucket: Refreshing state... [id=prod-animeutopia-media-bucket]
aws_xray_sampling_rule.fallback_rule: Refreshing state... [id=Fallback]
aws_iam_role.lambda_role: Refreshing state... [id=animeutopia_lambda_role]
aws_iam_role.crossaccount_s3_read_role: Refreshing state... [id=CrossAccountS3ReadRole]
data.aws_iam_policy_document.dlq_policy_document: Reading...
aws_cloudwatch_metric_alarm.dlq_alarm: Refreshing state... [id=animeutopia-dlq-alarm]
data.aws_iam_policy_document.dlq_policy_document: Read complete after 0s [id=699597804]
aws_sqs_queue_policy.lambda_dlq_policy: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/481665084477/animeutopia-lambda-dlq]
aws_iam_role_policy.step_functions_xray: Refreshing state... [id=animeutopia_step_functions_role:step-functions-xray-policy]
aws_s3_bucket_server_side_encryption_configuration.media_bucket_encryption: Refreshing state... [id=prod-animeutopia-media-bucket]
aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle: Refreshing state... [id=prod-animeutopia-media-bucket]
aws_s3_bucket_versioning.media_bucket_versioning: Refreshing state... [id=prod-animeutopia-media-bucket]
aws_lambda_function.sns_to_teams: Refreshing state... [id=sns_to_teams]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=animeutopia_lambda_role-20250326183359231400000003]
aws_lambda_function.fetch_data: Refreshing state... [id=fetch_data]
aws_lambda_function.check_duplicate: Refreshing state... [id=check_duplicate]
aws_iam_role_policy_attachment.lambda_insights_policy: Refreshing state... [id=animeutopia_lambda_role-20250326183359215200000002]
aws_iam_role_policy.lambda_sqs_send_message: Refreshing state... [id=animeutopia_lambda_role:animeutopia_lambda_sqs_send_message]
aws_iam_role_policy_attachment.lambda_s3_full_access: Refreshing state... [id=animeutopia_lambda_role-20250326183359245100000004]
aws_lambda_function.notify_post: Refreshing state... [id=notify_post]
aws_iam_role_policy_attachment.lambda_xray_write_access: Refreshing state... [id=animeutopia_lambda_role-20250326183359260700000005]
aws_iam_role_policy_attachment.lambda_sqs_send_message: Refreshing state... [id=animeutopia_lambda_role-20250326183359204000000001]
aws_iam_role_policy.crossaccount_s3_read_policy: Refreshing state... [id=CrossAccountS3ReadRole:ReadLogo]
aws_cloudwatch_metric_alarm.fetch_data_invocations_anomaly: Refreshing state... [id=animeutopia-fetch-data-invocations-anomaly]
aws_cloudwatch_metric_alarm.fetch_data_duration_high: Refreshing state... [id=animeutopia-fetch_data-duration-high]
aws_cloudwatch_metric_alarm.fetch_data_memory_high: Refreshing state... [id=animeutopia-fetch_data-memory-high]
aws_cloudwatch_metric_alarm.fetch_data_errors: Refreshing state... [id=animeutopia-fetch-data-errors]
aws_cloudwatch_metric_alarm.notify_post_invocations_anomaly: Refreshing state... [id=animeutopia-notify-post-invocations-anomaly]
aws_cloudwatch_metric_alarm.notify_post_errors: Refreshing state... [id=animeutopia-notify_post-errors]
aws_cloudwatch_metric_alarm.notify_post_duration_high: Refreshing state... [id=animeutopia-notify_post-duration-high]
aws_cloudwatch_metric_alarm.notify_post_memory_high: Refreshing state... [id=animeutopia-notify_post-memory-high]
aws_lambda_permission.allow_sns_invoke: Refreshing state... [id=AllowExecutionFromSNS]
aws_cloudwatch_metric_alarm.sns_to_teams_invocations_anomaly: Refreshing state... [id=animeutopia-sns-to-teams-invocations-anomaly]
aws_sns_topic_subscription.sns_lambda_subscription: Refreshing state... [id=arn:aws:sns:us-east-2:481665084477:animeutopia-monitoring-topic:530b16ae-e477-4abb-9f00-a66a1566c0df]
aws_cloudwatch_metric_alarm.check_duplicate_memory_high: Refreshing state... [id=animeutopia-check_duplicate-memory-high]
aws_iam_role_policy.step_functions_policy: Refreshing state... [id=animeutopia_step_functions_role:animeutopia_step_functions_policy]
aws_cloudwatch_metric_alarm.check_duplicate_duration_high: Refreshing state... [id=animeutopia-check_duplicate-duration-high]
aws_cloudwatch_metric_alarm.check_duplicate_invocations_anomaly: Refreshing state... [id=animeutopia-check-duplicate-invocations-anomaly]
aws_sfn_state_machine.automated_workflow: Refreshing state... [id=arn:aws:states:us-east-2:481665084477:stateMachine:automated_animeutopia_workflow]
aws_cloudwatch_metric_alarm.check_duplicate_errors: Refreshing state... [id=animeutopia-check_duplicate-errors]
aws_cloudwatch_dashboard.lambdas_dashboard: Refreshing state... [id=LambdaDashboard]
aws_cloudwatch_metric_alarm.automated_workflow_failures: Refreshing state... [id=animeutopia-automated-workflow-failures]
aws_cloudwatch_metric_alarm.automated_workflow_aborts: Refreshing state... [id=animeutopia-automated-workflow-aborts]
aws_cloudwatch_event_target.state_machine_target: Refreshing state... [id=animeutopia_workflow_schedule-animeutopia_StepFunctionStateMachine]
aws_cloudwatch_metric_alarm.automated_workflow_timeouts: Refreshing state... [id=animeutopia-automated-workflow-timeouts]
aws_iam_policy.eventbridge_policy: Refreshing state... [id=arn:aws:iam::481665084477:policy/animeutopia_eventbridge_step_functions_policy]
aws_cloudwatch_dashboard.step_functions_dashboard: Refreshing state... [id=StepFunctionsDashboard]
aws_iam_role_policy_attachment.attach_eventbridge_policy: Refreshing state... [id=animeutopia_eventbridge_step_functions_role-20250326183522106900000006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_lightsail_instance.ecommerce will be created
  + resource "aws_lightsail_instance" "ecommerce" {
      + arn                = (known after apply)
      + availability_zone  = "us-east-2a"
      + blueprint_id       = "lamp-8-3-17"
      + bundle_id          = "medium_2_0"
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ip_address_type    = "dualstack"
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + name               = "animeutopia-lamp"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + tags_all           = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + user_data          = <<-EOT
            #!/bin/bash
            apt-get update -y
            apt-get upgrade -y
            
            echo "<h1>Welcome to the AnimeUtopia store!</h1>" > /opt/bitnami/apache/htdocs/index.html
        EOT
      + username           = (known after apply)
    }

  # aws_lightsail_static_ip.ecommerce_ip will be created
  + resource "aws_lightsail_static_ip" "ecommerce_ip" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + ip_address   = (known after apply)
      + name         = "animeutopia-lamp-static-ip"
      + support_code = (known after apply)
    }

  # aws_lightsail_static_ip_attachment.ecommerce_ip_attachment will be created
  + resource "aws_lightsail_static_ip_attachment" "ecommerce_ip_attachment" {
      + id             = (known after apply)
      + instance_name  = "animeutopia-lamp"
      + ip_address     = (known after apply)
      + static_ip_name = "animeutopia-lamp-static-ip"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Error: Cannot assume IAM Role
│ 
│   with provider["registry.terraform.io/hashicorp/aws"].dns,
│   on providers.tf line 17, in provider "aws":
│   17: provider "aws" {
│ 
│ IAM Role (arn:aws:iam::825765422855:role/animeutopia_DNSRole) cannot be
│ assumed.
│ 
│ There are a number of possible causes of this - the most common are:
│   * The credentials used in order to assume the role are invalid
│   * The credentials do not have appropriate permission to assume the role
│   * The role ARN is not valid
│ 
│ Error: operation error STS: AssumeRole, https response error StatusCode:
│ 403, RequestID: 14b6e654-e48b-4eee-8b76-db1bdf2b831e, api error
│ AccessDenied: User:
│ arn:aws:sts::825765422855:assumed-role/Atlantis-EC2-Role/i-073831c64e26eccf3
│ is not authorized to perform: sts:AssumeRole on resource:
│ arn:aws:iam::825765422855:role/animeutopia_DNSRole
│ 
╵


```
</details>